// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

Console.Write("Введите трёхзначное число: ");
    int number = int.Parse(Console.ReadLine());
        Console.WriteLine("Вторая цифра: {0}", number % 100 / 10);
